# PlumbingFixturesTrap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlumbingFixturesTrap Property
ParameterTypeId Class See Also
---
"Trap"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlumbingFixturesTrap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlumbingFixturesTrap As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlumbingFixturesTrap {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace